
import {useState} from 'react';
import Accordion from './Accordion';

const Faq = () => {
    const [list, setList] = useState ([
        {
            question: 'Mastering Selling Machine মডিউলটির মূল্য অবজেক্টিভ কি?',
            answer:'ফূয়েল ছাড়া যেমন গাড়ি চলতে পারে না, তেমনি সেলস্‌ ছাড়া কোন বিজনেস চলতে পারে না। যেকোন পন্য/সেবা বিক্রয় করার জন্য নিজের ব্যবসায় একটি “SELLING MACHINE” তৈরি করা আবশ্যক। ',
            answers: '👉 আপনার ব্যবসার সেলস্‌ জ্যামিতিক হারে বাড়ানোর একমাত্র উপায় হচ্ছে “SELLING MACHINE” ' ,
            answered: '👉 আর “SELLING MACHINE” তৈরি ও প্রয়োগ করে সর্বোচ্চ রেজাল্ট নিশ্চিত করার একমাত্র উপায় হচ্ছে “MASTERING SELLING MACHINE” – Learn to Sell Anything!'
          
        },
        {
            question: 'MSM মডিউলে এনরোল নিতে চাই কোন ডিসকাউন্ট কুপন আছে কি?',
            answer: '৩০০০০ (ত্রিশ হাজার) টাকার চাইতেও বেশি ভ্যালূর এই মডিউলটি বর্তমানে প্রায় ৯৫% ছাড়ে মাত্র ১৫০০ (এক হাজার পাচশত) টাকায় রেজিস্ট্রেশন করার সুযোগ দেয়া হয়েছে। কোন কুপন এর প্রয়োজন হবে না, সরাসরি ডিসকাউন্ট প্রাইজ আপডেট করা আছে। '
        },
        {
            question: 'MSM মডিউলে এনরোল নেয়ার ধাপগুলো কি কি?',
            answer:'১। অর্ডার ফর্ম এ পেমেন্ট মেথড হিসাবে বিকাশ/রকেট/নগদ সিলেক্ট করুন।  ',
            answers: '২। স্ক্রিনে দেখানো আমাদের সংশ্লিষ্ট মোবাইল ব্যাংকিং নাম্বারে সেন্ডমানি করে প্রয়োজনীয় রেজিস্ট্রেশন ফি সেন্ড করুন। ' ,
            answered: '৩। আপনার মোবাইলের মেসেজে আসা সাকসেসফুল পেমেন্টর ট্রানজেকশন নাম্বার আমাদের অর্ডার ফর্ম এর নির্ধারিত ইনপুট ফিল্ডে লিখুন ও যেই নাম্বার থেকে সেন্ড করেছেন তা লিখুন।',
            answer4: 'Place Order বাটনে ক্লিক করে অর্ডার ফর্ম সাবমিট করে দিন।'
        },
        {
            question: 'আমি অনলাইনে একদম নতুন, আমি কি MSM এনরোল নিয়ে ভালো করতে পারবো?',
            answer: 'মডিউলে ভিডিও কন্টেন্টগুলো অত্যন্ত যত্ন সহকারে তৈরি করা হয়েছে ও যেখানে ব্যাখ্যা করা প্রয়োজন সেখানে ব্যাখ্যা করে বুঝিয়ে দেয়া হয়েছে। একজন নতুন শিক্ষার্থী থেকে শুরু করে পুরোনো ব্যবসায়ীরা বা প্রফেশনালরাও আমাদের মডিউল থেকে শিখতে পারবেন ইনশাআল্লাহ। '
        },
        {
            question: 'MSM মডিউলে কি লাইফটাইম একসেস দেয়া হচ্ছে?',
            answer: 'অবশ্যই, মডিউল এর উপর লাইফটাইম ভিডিও একসেস পেয়ে যাবেন। আমাদের প্রতিনিধি সিক্রেট ফেসবুক সাপোর্ট গ্রুপের একসেস দেয়ার ব্যবস্থা করবেন। ভিডিও দেখার পর যেকোন ইস্যূ ফেইস করলে বা বুঝতে সমস্যা হলে সাথে সাথে প্রাইভেট সাপোর্ট গ্রুপে প্রশ্ন করে উত্তর নিতে পারবেন। তাছাড়াও প্রতি সপ্তাহে অন্তঃত একবার জুমের মাধ্যমে লাইভ প্রবলেম সলিউশন ও আইডিয়া শেয়ারিং ক্লাশ পরিচালনা করে থাকেন আমাদের মেন্টর।'
        },

        
    ])
    return (
        <div className='bg-[#FFF7F7] mt-12'>
             <h1 className="text-5xl text-black text-center  font-bold pt-8 pb-10">F.A.Q</h1>
            <div>
            {
            list.map((item,key)=>(
                <Accordion key={key} datas = {item}/>
            ))
            }
            </div>
        </div>
    );
};

export default Faq;

